[
  {
    "date": "Feb 2025 – Present",
    "title": "Explainable Ensemble Learning for CO2 Emissions Forecasting",
    "position": "Research Group Leader, Emory Office of Sustainability",
    "bullets": [
      "Built an ensemble deep learning pipeline to predict vehicle CO₂ emissions with an R² exceeding 0.99.",
      "Integrated DNN, XGBoost, and Random Forest to identify key emission drivers such as fuel type and engine size.",
      "Applied SHAP to validate model decisions and generate actionable insights for sustainable transportation."
    ]
  },
  {
    "date": "Jan 2025 – Present",
    "title": "MIMIC Database (Causal Analysis and Forecasting)",
    "position": "Independent Researcher, Emory College Department of Quantitative Theory and Methods",
    "bullets": [
      "Developed a multimodal DL framework integrating LLaMA-based clinical text, time-series vitals, and EHR data.",
      "Built a causal transformer using DML, domain adversarial learning, and orthogonality constraints.",
      "Engineered imputation for missing modalities and optimized GPU training on 2M+ ICU records using TensorFlow."
    ]
  },
  {
    "date": "Jun 2024 – Present",
    "title": "Research on Transformer-Based Sentiment Analysis",
    "position": "Independent Researcher, Independent Research in NLP (Co-Authored Publication)",
    "bullets": [
      "Proposed GDLGA model combining BERT with local attention for short-text sentiment analysis.",
      "Achieved F1 score of 87.49% and AUC of 0.9484 on Sentiment140, outperforming baselines.",
      "Validated each component (global/local/gated fusion) via comprehensive ablation studies.",
      "See<a href=\"https://www.techrxiv.org/doi/full/10.36227/techrxiv.174495340.03183932/v1\" target=\"_blank\">pre-print</a> for full results and model details."
    ]
  },  
  {
    "date": "Sep 2024 – Present",
    "title": "Collective Action & Research for Equity (CARE) Lab",
    "position": "Undergraduate Research Assistant, Emory School of Medicine Department of Biomedical Informatics",
    "bullets": [
      "Visualized 300+ user records through an interactive dashboard built with JavaScript, Python, and HTML.",
      "Created 20+ pages of technical documentation for the Education Bot to aid usability and onboarding."
    ]
  },
  {
    "date": "Jun 2024 – Present",
    "title": "Game-Theoretic Analysis of Autonomous Taxis and Labor Market Dynamics",
    "position": "Independent Researcher, Independent Research in Game Theory (Co-Authored Publication)",
    "bullets": [
      "Modeled dynamic interactions among governments, firms, and workers in autonomous taxi adoption.",
      "Simulated loss aversion and risk in labor response using game theory and behavioral economics.",
      "Identified stable equilibrium strategies under moderate regulation; warned against extreme subsidies.",
      "See<a href=\"https://papers.ssrn.com/sol3/papers.cfm?abstract_id=5192917\" target=\"_blank\">pre-print</a> for full results and model details."
    ]
  }
]